<?php
return [
    'title' => 'แผนก',
    'new' => 'เพิ่มแผนกใหม่',
    'name' => 'ชื่อแผนก',
    'action' => 'การกระทำ',
    'view' => 'ดูข้อมูล',
    'edit' => 'แก้ไข',
    'delete' => 'ลบ',

    // ยืนยันการลบ
    'confirm_title' => 'คุณแน่ใจหรือไม่?',
    'confirm_text' => 'หากคุณลบข้อมูลนี้ จะไม่สามารถกู้คืนได้',
    'deleted' => 'ลบสำเร็จ',

    // หน้าเพิ่มแผนก
    'create_department' => 'สร้างแผนก',
    'departments' => 'รายชื่อแผนก',
    'name_th' => 'ชื่อแผนก (ภาษาไทย)',
    'name_en' => 'ชื่อแผนก (ภาษาอังกฤษ)',
    'submit' => 'บันทึก',
    'back' => 'กลับ',
    'error' => 'เกิดข้อผิดพลาด กรุณาตรวจสอบข้อมูลที่กรอก',
];
